{
  "navigation": {
    "home": "ProcessPuzzle Testbed - Inicio",
    "util": "ProcessPuzzle Testbed - Utilidades",
    "widgets": "ProcessPuzzle Testbed - Widgets",
    "auth": "ProcessPuzzle Testbed - Autenticación",
    "base-entity": "ProcessPuzzle Testbed - Entidad Base",
    "ci-cd": "ProcessPuzzle Testbed - CI/CD"
  },
  "home": {
    "introduction": "ProcessPuzzle/... es un conjunto de bibliotecas para facilitar la construcción de una aplicación Angular. Ayuda con tareas de muy bajo nivel como la inicialización de aplicaciones o una plataforma **Low-Code** para generar tablas y formularios CRUD en tiempo de ejecución a partir de descriptores de entidades.",
    "utils_card_subtitle": "Funciones y componentes muy básicos",
    "utils_card_content": "Esta es una colección de funciones, servicios y componentes útiles para construir aplicaciones Angular. El paquete contiene:",
    "utils_card_content_1": "runtime-configuration - lee el tiempo de ejecución de la aplicación, en la inicialización de la aplicación",
    "utils_card_content_2": "app-initializer - servicio que ayuda en la inicialización de la aplicación",
    "utils_card_content_3": "layout-service - para ayudar con diseños responsivos",
    "utils_card_button": "Ver Biblioteca de Utilidades...",
    "widgets_card_subtitle": "Componentes de UI simples y reutilizables",
    "widgets_card_content": "Esta es una colección de componentes de UI útiles para construir interfaces de usuario en Angular. El paquete contiene:",
    "widgets_card_content_1": "Botón Atrás - navega de vuelta a la página anterior",
    "widgets_card_content_2": "Botón Me gusta - permite contar fans para la página",
    "widgets_card_content_3": "Botón Compartir - facilita compartir un enlace a la aplicación con otros",
    "widgets_card_button": "Ver Biblioteca de Widgets...",
    "auth_card_subtitle": "Autenticación y Autorización",
    "auth_card_content": "Esta es una colección de componentes de UI y servicios para autenticación y autorización. El paquete contiene:",
    "auth_card_content_1": "Botón de Autenticación - menú para acciones de autenticación",
    "auth_card_content_2": "Componente de Inicio de Sesión - facilita el inicio de sesión del usuario",
    "auth_card_content_3": "Componente de Cierre de Sesión - facilita el cierre de sesión",
    "auth_card_content_4": "Componente de Registro - facilita el registro de usuarios",
    "auth_card_content_5": "Componente Mi Perfil - permite revisar y cambiar los datos del perfil de usuario",
    "auth_card_content_6": "Servicio de Autenticación - ayuda a autenticar usuarios",
    "auth_card_content_7": "Guardia de Autenticación - soporta autorización a través de rutas",
    "auth_card_button": "Ver Biblioteca de Autenticación...",
    "base-entity_card_subtitle": "Clases base para formularios reactivos y tablas de material",
    "base-entity_card_content": "Facilita la construcción de Formularios y Tablas completamente funcionales con conexión a fuentes de datos y soporte de gestión de estado Signal Store a partir de una simple Definición de Entidad.",
    "base-entity_card_content_1": "Genera Tablas de Material Angular con capacidades de filtrado, búsqueda y paginación",
    "base-entity_card_content_2": "Genera formularios reactivos completos con verificaciones y mensajes de error",
    "base-entity_card_content_3": "Genera encabezados dependientes del estado para navegar de la tabla al formulario y viceversa",
    "base-entity_card_button": "Ver Biblioteca de Entidad Base...",
    "ci-cd_card_subtitle": "Proceso de entrega continua basado en GitHub Actions",
    "ci-cd_card_content": "Esto no es una biblioteca, sino una solución de extremo a extremo para el proceso de entrega continua, basada en GitHub Actions.\n            Soporta múltiples prácticas de garantía de calidad y múltiples etapas de desarrollo. Al final, entrega incrementos automáticamente a producción.",
    "ci-cd_card_content_1": "Soporta lint, pruebas y compilación",
    "ci-cd_card_content_2": "Soporta despliegue en AWS o Firebase",
    "ci-cd_card_content_3": "Soporta publicación en el registro NPM",
    "ci-cd_card_button": "Ver Pipeline de CI/CD..."
  }
}
