{
  "navigation": {
    "home": "ProcessPuzzle Testbed - Accueil",
    "util": "ProcessPuzzle Testbed - Utilitaires",
    "test-util": "ProcessPuzzle Testbed - Utilitaires de Test",
    "widgets": "ProcessPuzzle Testbed - Widgets",
    "auth": "ProcessPuzzle Testbed - Authentification",
    "base-entity": "ProcessPuzzle Testbed - Entité de Base",
    "ci-cd": "ProcessPuzzle Testbed - CI/CD"
  },
  "home": {
    "introduction": "ProcessPuzzle/... est un ensemble de bibliothèques pour faciliter la construction d'une application Angular. Il aide pour des tâches de très bas niveau comme l'initialisation d'application ou une plateforme **Low-Code** pour générer des tableaux et des formulaires CRUD en temps réel à partir de descripteurs d'entités.",
    "utils_card_subtitle": "Fonctions et composants très basiques",
    "utils_card_content": "C'est une collection de fonctions, services et composants utiles lors de la construction d'applications Angular. Le package contient:",
    "utils_card_content_1": "runtime-configuration - lit l'exécution de l'application, à l'initialisation de l'application",
    "utils_card_content_2": "app-initializer - service qui aide à l'initialisation de l'application",
    "utils_card_content_3": "layout-service - pour aider avec les mises en page responsives",
    "utils_card_button": "Voir la bibliothèque Utils...",
    "widgets_card_subtitle": "Composants UI simples et réutilisables",
    "widgets_card_content": "C'est une collection de composants UI utiles lors de la construction d'une interface utilisateur Angular. Le package contient:",
    "widgets_card_content_1": "Bouton Retour - navigue vers la page précédente",
    "widgets_card_content_2": "Bouton J'aime - permet de compter les fans de la page",
    "widgets_card_content_3": "Bouton Partager - facilite le partage d'un lien vers l'application avec d'autres",
    "widgets_card_button": "Voir la bibliothèque Widgets...",
    "auth_card_subtitle": "Authentification et Autorisation",
    "auth_card_content": "C'est une collection de composants UI et de services pour l'authentification et l'autorisation. Le package contient:",
    "auth_card_content_1": "Bouton Auth - menu pour les actions d'authentification",
    "auth_card_content_2": "Composant de Connexion - facilite la connexion de l'utilisateur",
    "auth_card_content_3": "Composant de Déconnexion - facilite la déconnexion",
    "auth_card_content_4": "Composant d'Inscription - facilite l'inscription de l'utilisateur",
    "auth_card_content_5": "Composant Mon Profil - permet de consulter et de modifier les données du profil utilisateur",
    "auth_card_content_6": "Service Auth - aide à authentifier les utilisateurs",
    "auth_card_content_7": "Garde Auth - supporte l'autorisation via les routes",
    "auth_card_button": "Voir la bibliothèque Auth...",
    "base-entity_card_subtitle": "Classes de base pour les formulaires réactifs et les tableaux matériels",
    "base-entity_card_content": "Facilite la construction de formulaires et de tableaux entièrement fonctionnels avec connexion à la source de données et prise en charge de la gestion d'état Signal Store à partir d'une simple définition d'entité.",
    "base-entity_card_content_1": "Générer un tableau Material Angular avec des capacités de filtrage, de recherche et de pagination",
    "base-entity_card_content_2": "Générer un formulaire réactif complet avec vérifications et messages d'erreur",
    "base-entity_card_content_3": "Générer un en-tête dépendant de l'état pour naviguer du tableau au formulaire et inversement",
    "base-entity_card_button": "Voir la bibliothèque Base Entity...",
    "test-utils_card_subtitle": "Utilitaires pour les tests unitaires et d'intégration",
    "test-utils_card_content": "C'est une collection de fonctions et de services pour faciliter les tests unitaires et d'intégration.",
    "test-utils_card_content_1": "mock-breakpoint-observer - aide à tester les pages responsives. Imite le redimensionnement d'une page.",
    "test-utils_card_content_2": "transloco-testing-module - configure Transloco pour tester les composants avec des capacités i18n.",
    "test-utils_card_content_3": "layout-service - pour aider avec les mises en page responsives",
    "test-utils_card_button": "Voir la bibliothèque Test Utils...",
    "ci-cd_card_subtitle": "Processus de livraison continue basé sur GitHub Actions",
    "ci-cd_card_content": "Ce n'est pas une bibliothèque, mais une solution de bout en bout pour le pipeline de livraison continue, basée sur GitHub Actions. Elle prend en charge plusieurs pratiques d'assurance qualité et plusieurs étapes de développement. À la fin, elle livre automatiquement des incréments en production.",
    "ci-cd_card_content_1": "Prend en charge lint, test et build",
    "ci-cd_card_content_2": "Prend en charge le déploiement sur AWS ou Firebase",
    "ci-cd_card_content_3": "Prend en charge la publication sur le registre NPM",
    "ci-cd_card_button": "Voir le pipeline CI/CD..."
  },
  "base-entity": {
    "overview_tab_label": "Aperçu",
    "samples_tab_label": "Exemples",
    "samples_desc_1": "Les entités d'exemple, pour démontrer la fonctionnalité de cette bibliothèque sont les suivantes:",
    "samples_desc_2": "Les tableaux et formulaires ci-dessous sont générés à partir des entités et de leurs descripteurs d'attributs, en temps réel."
  }
}
